{"keras_version": "2.0.6", "config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_conv1", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 64}, "class_name": "Conv2D", "name": "block1_conv1"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_conv2", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 64}, "class_name": "Conv2D", "name": "block1_conv2"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "name": "block1_pool", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block1_pool"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_conv1", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 128}, "class_name": "Conv2D", "name": "block2_conv1"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_conv2", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 128}, "class_name": "Conv2D", "name": "block2_conv2"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block2_pool", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block2_pool"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv1", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 256}, "class_name": "Conv2D", "name": "block3_conv1"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv2", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 256}, "class_name": "Conv2D", "name": "block3_conv2"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv3", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 256}, "class_name": "Conv2D", "name": "block3_conv3"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv4", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 256}, "class_name": "Conv2D", "name": "block3_conv4"}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block3_pool", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block3_pool"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv1", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block4_conv1"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv2", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block4_conv2"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv3", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block4_conv3"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv4", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block4_conv4"}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block4_pool", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block4_pool"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv1", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block5_conv1"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv2", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block5_conv2"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv3", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block5_conv3"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv4", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 512}, "class_name": "Conv2D", "name": "block5_conv4"}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block5_pool", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block5_pool"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "units": 1024, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "units": 1024, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true}, "class_name": "Dense", "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "use_bias": true, "units": 12, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "trainable": true}, "class_name": "Dense", "name": "dense_3"}]}, "backend": "tensorflow", "class_name": "Model"}